color_dict ={
  "У вас є відчуття нестачі енергії?":                                                  {"yellow": 1, "green": 0, "cyan": 1, "red": 1, "gray": 1, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 0},
#  "Ви часто хворієте (більше 2 разів на рік)?":                                         {"yellow": 0, "green": 0, "cyan": 0, "red": 0, "gray": 1, "purple": 0, "orange": 0, "magenta": 0, "blue": 0, "pink": 1},
#  "Неприємний запах тіла або з рота (або тяжке дихання).":                              {"yellow": 1, "green": 1, "cyan": 0, "red": 0, "gray": 0, "purple": 1, "orange": 1, "magenta": 0, "blue": 0, "pink": 0},
#  "Погано перетравлюються деякі продукти. У вас є важкість, здуття, проноси, закрепи.": {"yellow": 1, "green": 0, "cyan": 0, "red": 0, "gray": 1, "purple": 0, "orange": 0, "magenta": 0, "blue": 0, "pink": 0},
#  "Ви їсте червоне м'ясо 2 і більше разів на тиждень?":                                 {"yellow": 0, "green": 1, "cyan": 1, "red": 0, "gray": 0, "purple": 1, "orange": 0, "magenta": 0, "blue": 0, "pink": 0},
#  "Проблеми з менструальним циклом (для жінок).":                                       {"yellow": 0, "green": 1, "cyan": 0, "red": 0, "gray": 0, "purple": 0, "orange": 1, "magenta": 1, "blue": 0, "pink": 0},
#  "Використовуєте антибіотики (інші ліки) більше 2 разів на рік.":                      {"yellow": 0, "green": 1, "cyan": 0, "red": 0, "gray": 1, "purple": 0, "orange": 0, "magenta": 0, "blue": 0, "pink": 0},
#  "Регулярно споживаєте алкоголь.":                                                     {"yellow": 0, "green": 0, "cyan": 0, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 0},
#  "Перепади настрою.":                                                                  {"yellow": 0, "green": 0, "cyan": 0, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 0},
#  "Харчова алергія.":                                                                   {"yellow": 1, "green": 0, "cyan": 0, "red": 0, "gray": 1, "purple": 1, "orange": 0, "magenta": 0, "blue": 0, "pink": 1},
#  "Темні кола та (або) набряклість під очима.":                                         {"yellow": 0, "green": 0, "cyan": 1, "red": 1, "gray": 0, "purple": 0, "orange": 1, "magenta": 0, "blue": 0, "pink": 1},
#  "Ви палите будь які цигарки(в тому числі пасивно)?":                                  {"yellow": 0, "green": 0, "cyan": 1, "red": 1, "gray": 0, "purple": 1, "orange": 0, "magenta": 0, "blue": 0, "pink": 1},
#  "Важко сконцентруватися, погане запам'ятовування.":                                   {"yellow": 0, "green": 0, "cyan": 1, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 0},
#  "Погана переносимость хворобливих станів.":                                           {"yellow": 1, "green": 0, "cyan": 0, "red": 0, "gray": 1, "purple": 0, "orange": 0, "magenta": 0, "blue": 0, "pink": 0},
#  "Будь який дискомфорт після прийняття їжі.":                                          {"yellow": 1, "green": 0, "cyan": 0, "red": 0, "gray": 1, "purple": 0, "orange": 0, "magenta": 0, "blue": 0, "pink": 0},
#  "Нервова обстановка, надлишок стресів.":                                              {"yellow": 0, "green": 0, "cyan": 1, "red": 1, "gray": 1, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 1},
#  "Проблеми зі шкірою.":                                                                {"yellow": 1, "green": 1, "cyan": 0, "red": 0, "gray": 0, "purple": 0, "orange": 1, "magenta": 1, "blue": 1, "pink": 1},
#  "Споживання солодкої та переробленої їжі.":                                           {"yellow": 0, "green": 0, "cyan": 0, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 0},
#  "Надмірне вживання молочних продуктів.":                                              {"yellow": 0, "green": 1, "cyan": 0, "red": 0, "gray": 0, "purple": 1, "orange": 0, "magenta": 0, "blue": 0, "pink": 0},
#  "Почуття апатії, млявості, депресія.":                                                {"yellow": 0, "green": 1, "cyan": 0, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 0},
#  "Сон, що не приносить відпочинку.":                                                   {"yellow": 0, "green": 0, "cyan": 0, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 0},
#  "Період менопаузи.":                                                                  {"yellow": 0, "green": 0, "cyan": 0, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 1, "pink": 0},
#  "Проблеми з сечовипусканням.":                                                        {"yellow": 0, "green": 0, "cyan": 0, "red": 0, "gray": 0, "purple": 0, "orange": 1, "magenta": 0, "blue": 0, "pink": 0},
#  "Чутлива витончена шкіра, зморшки, відчуття сухості.":                                {"yellow": 0, "green": 0, "cyan": 0, "red": 0, "gray": 0, "purple": 0, "orange": 0, "magenta": 0, "blue": 0, "pink": 1},
#  "Випадання волосся.":                                                                 {"yellow": 0, "green": 0, "cyan": 1, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 1, "pink": 0},
#  "Набряки та болі в суглобах.":                                                        {"yellow": 0, "green": 0, "cyan": 1, "red": 0, "gray": 1, "purple": 0, "orange": 0, "magenta": 0, "blue": 1, "pink": 0},
#  "Проблеми збереження нормальної ваги.":                                               {"yellow": 0, "green": 0, "cyan": 0, "red": 1, "gray": 1, "purple": 0, "orange": 0, "magenta": 1, "blue": 1, "pink": 0},
#  "Швидка стомлюваність (брак сили, витривалості).":                                    {"yellow": 0, "green": 0, "cyan": 1, "red": 0, "gray": 0, "purple": 1, "orange": 0, "magenta": 0, "blue": 1, "pink": 0},
#  "Недотримання режиму живлення (харчування та питного режиму).":                       {"yellow": 1, "green": 1, "cyan": 0, "red": 0, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 1},
#  "Повільне одужання від застуд та вірусів.":                                           {"yellow": 0, "green": 1, "cyan": 1, "red": 0, "gray": 1, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 0},
#  "Нерегулярний стілець.":                                                              {"yellow": 1, "green": 1, "cyan": 0, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 0, "blue": 0, "pink": 1},
#  "Поганий апетит.":                                                                    {"yellow": 1, "green": 0, "cyan": 0, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 0},
#  "Низька сексуальна активність.":                                                      {"yellow": 0, "green": 0, "cyan": 0, "red": 0, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 0},
#  "Витончені і ламкі нігті (нігті, що шаруються).":                                     {"yellow": 1, "green": 0, "cyan": 0, "red": 0, "gray": 0, "purple": 0, "orange": 0, "magenta": 0, "blue": 1, "pink": 0},
#  "Сухе, тьмяне, пошкоджене волосся.":                                                  {"yellow": 1, "green": 0, "cyan": 0, "red": 0, "gray": 0, "purple": 0, "orange": 1, "magenta": 0, "blue": 0, "pink": 0},
#  "Вживання жирної їжі.":                                                               {"yellow": 1, "green": 1, "cyan": 1, "red": 0, "gray": 0, "purple": 0, "orange": 0, "magenta": 0, "blue": 0, "pink": 0},
#  "Нестача клітковини в раціоні.":                                                      {"yellow": 0, "green": 1, "cyan": 1, "red": 0, "gray": 0, "purple": 0, "orange": 0, "magenta": 0, "blue": 0, "pink": 0},
#  "М'язовий дискомфорт (болі, судоми).":                                                {"yellow": 0, "green": 0, "cyan": 1, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 0, "blue": 1, "pink": 0},
#  "Несприятлива екологія.":                                                             {"yellow": 0, "green": 0, "cyan": 0, "red": 0, "gray": 1, "purple": 1, "orange": 0, "magenta": 0, "blue": 0, "pink": 1},
#  "Денна сонливість.":                                                                  {"yellow": 0, "green": 0, "cyan": 1, "red": 0, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 0},
#  "Часте споживання кави або чаю.":                                                     {"yellow": 0, "green": 0, "cyan": 0, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 1, "pink": 0},
#  "Гіперчутливість до хімікатів, ліків, їжі.":                                          {"yellow": 1, "green": 1, "cyan": 0, "red": 0, "gray": 1, "purple": 0, "orange": 0, "magenta": 0, "blue": 0, "pink": 0},
#  "Будь які грибкові ураження.":                                                        {"yellow": 1, "green": 1, "cyan": 0, "red": 0, "gray": 1, "purple": 0, "orange": 1, "magenta": 0, "blue": 0, "pink": 0},
#  "Слабкість у м'язах, крихкість кісток.":                                              {"yellow": 1, "green": 0, "cyan": 0, "red": 0, "gray": 0, "purple": 0, "orange": 0, "magenta": 0, "blue": 1, "pink": 0},
#  "Постійна тривога.":                                                                  {"yellow": 1, "green": 0, "cyan": 0, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 0, "blue": 0, "pink": 0},
#  "Підвищена дратівливість, надмірна збудливість, агресія.":                            {"yellow": 0, "green": 1, "cyan": 0, "red": 1, "gray": 0, "purple": 0, "orange": 0, "magenta": 1, "blue": 0, "pink": 0},
#  "Малорухливий спосіб життя, низька фізична активність.":                              {"yellow": 0, "green": 1, "cyan": 1, "red": 1, "gray": 1, "purple": 0, "orange": 0, "magenta": 1, "blue": 1, "pink": 0},
#  "Підвищене виділення мокротиння (виділення слизу).":                                  {"yellow": 0, "green": 1, "cyan": 0, "red": 0, "gray": 0, "purple": 1, "orange": 0, "magenta": 0, "blue": 0, "pink": 0},
  "Великі пори на шкірі, підвищене саловиділення, вугри.":                              {"yellow": 0, "green": 0, "cyan": 0, "red": 0, "gray": 0, "purple": 0, "orange": 0, "magenta": 0, "blue": 0, "pink": 1}
}
evaluation_criteria = {
    "yellow":   [(2, "дуже добре"), (4, "добре"), (9, "задовільно"), (float('inf'), "незадовільно")],
    "green":    [(2, "дуже добре"), (4, "добре"), (9, "задовільно"), (float('inf'), "незадовільно")],
    "cyan":     [(2, "дуже добре"), (3, "добре"), (7, "задовільно"), (float('inf'), "незадовільно")],
    "red":      [(2, "дуже добре"), (5, "добре"), (9, "задовільно"), (float('inf'), "незадовільно")],
    "gray":     [(2, "дуже добре"), (4, "добре"), (7, "задовільно"), (float('inf'), "незадовільно")],
    "purple":   [(0, "дуже добре"), (3, "добре"), (5, "задовільно"), (float('inf'), "незадовільно")],
    "orange":   [(0, "дуже добре"), (1, "добре"), (4, "задовільно"), (float('inf'), "незадовільно")],
    "magenta":  [(2, "дуже добре"), (5, "добре"), (9, "задовільно"), (float('inf'), "незадовільно")],
    "blue":     [(1, "дуже добре"), (3, "добре"), (8, "задовільно"), (float('inf'), "незадовільно")],
    "pink":     [(1, "дуже добре"), (3, "добре"), (6, "задовільно"), (float('inf'), "незадовільно")]
}
color_to_system = {
    "yellow":   "Травна система",
    "green":    "Шлунково-кишковий тракт",
    "cyan":     "Серцево-судинна система",
    "red":      "Нервова система",
    "gray":     "Імунна система",
    "purple":   "Дихальна система",
    "orange":   "Сечовидільна система",
    "magenta":  "Ендокринна система",
    "blue":     "Опорно-рухова система",
    "pink":     "Шкіра"
}
evaluation_icons = {
    "дуже добре":   "🟢",
    "добре":        "🟡",
    "задовільно":   "🟠",
    "незадовільно": "🔴"
}
MENUS = {
    1: (
        "Завтра вас чекає смачна подорож до оновлення та здоров’я!\n"
        "Це реально перевірені та смачні страви з простих продуктів.\n"
        "Тож закупіть продукти, віддайте цукерки та тістечка сусідам (почистить холодильник від зайвого та не корисного) і потурбуйтеся про наявність чистої питної води.\n"
        "Заплануйте ранкову розминку, тренування або ходьбу пішки.\n\n"
        "А якщо вам цікаво більше дізнатися про стан свого здоров’я, на зараз, то ви можете пройти аналітичний тест здоровʼя і я вам відправлю результати.\n"
        "Ось посилання ⬇"
    ),
    2: "Текст меню дня 2...",
    3: "Текст меню дня 3...",
    4: "Текст меню дня 4...",
    5: "Текст меню дня 5...",
    6: "Текст меню дня 6...",
    7: "Текст меню дня 7...",
}

REMINDER_TEXTS = {
    1: (
        "⏰ Нагадую, що вам потрібно зважитись і відправити мені результати.\n"
        "Робіть це до сніданку, але після туалету.\n"
        "А ще вам потрібно випити першу склянку чистої води, зробити розминку та посміхнутися світові.\n"
        "У вас все обов’язково вийде!"
    ),
    2: (
        "⏰ Доброго ранку! Сьогодні вже другий день уваги до себе і свого здоров’я!\n"
        "Нагадую, що вам потрібно зважитись і відправити мені результати.\n"
        "Як нутриціолог, та людина, яка провела вже десятки марафонів та курсів оздоровлення, я точно знаю, що у вас можуть зʼявитися закрепи.\n"
        "Не турбуйтеся! Зміна харчування та питного режиму може дати такий ефект.\n"
        "Зʼїште на ніч буряк або два ківі.\n"
        "А ще в нас є купа чудових фіто-комплексів, які допомагають вирішувати проблеми із шлунком, печінкою, тощо.\n"
        "Але про це я розповім пізніше."
    ),
    3: (
        "⏰ Нагадую про зважування!\n"
        "День третій і я сподіваюся, що вам вдалося втілити хоч якісь кроки користі для себе, нехай навіть не на всі 100 відсотків!\n"
        "Але вода, здоровий сніданок, режим харчування без перекусів завжди працюють!!!\n\n"
        "І ще! Такі симптоми як печія, зайве газоутворення, закрепи або навпаки - то зовсім не норма!\n"
        "І це також можна виправити за рахунок фітопрепаратів.\n"
        "Бо саме від нашого шлунку залежить стан всіх інших наших систем!"
    ),
    4: (
        "⏰ Добрий ранок!\n"
        "Сьогодні четвертий день вашого власного марафону здоров’я та активного довголіття!\n"
        "Саме час зважитися та зафіксувати свої результати.\n"
        "Не переживайте якщо на вагах після мінусів попередніх днів зʼявляється плюс.\n"
        "Якщо ви не порушували режим і тримаєтеся меню, таке також може статися, бо тіло починає перебудову і ще очистку.\n"
        "Ви можете помітити різкий запах з роту або в туалеті.\n"
        "Ось тут було б добре додати ще води. Тримайте питний режим і режим тренувань!\n\n"
        "Якщо вам після експрес-марафону захочеться стати ще більш стрункими, здоровими та сильними, на фініші я додам спеціальний подарунок!\n"
        "А поки що рухаємось далі!"
    ),
    5: (
        "⏰ День пʼятий. Добрий ранок!\n"
        "Нагадую про зваження!\n"
        "Тіло, яке харчується правильно, має достатньо води та тренувань - цього важко досягти одразу.\n"
        "Але ви вже на шляху!\n"
        "Тож будь ласка не здавайтеся.\n\n"
        "Я вам паралельно надсилаю відео та фото для натхнення.\n"
        "І це все реальні історії та можливості."
    ),
    6: (
        "⏰ День шість. Добрий ранок!\n"
        "Нагадую про зваження!\n"
        "Нагадую про те, що ви почали цей шлях виключно для себе.\n"
        "Щоб покращити стан свого здоров’я та бути більш активною людиною.\n"
        "Нелегко перекроїти свої звички, але відчути полегшення від певних дій ви можете вже зараз!\n\n"
        "Паралельно з вами цей марафон проходять сотні хлопців та дівчат різного віку.\n"
        "І абсолютно всі мають позитивний результат!\n"
        "Навіть якщо то просто відчуття легкості!"
    ),
    7: (
        "⏰ Добрий ранок!\n"
        "Нагадую про передостаннє зважування цього експрес-марафону.\n"
        "Коротку дистанцію легше долати, тож сподіваюся, що тобі вдалося налагодити харчування, питний режим, тренування.\n"
        "Знов таки, можливо на 10 відсотків від всієї програми, але це твій влучний ритм!"
    )
}

WEIGHT_TRACKING_INSTRUCTIONS = (
    "📋 Це таблиця вашого меню оновлення, детоксу та щоб скинути пару зайвих кілограмів за тиждень і + мої рекомендації до режиму дня.\n\n"
    "Зверніть увагу на останній стовпчик і памʼятайте, що без фізичного навантаження не буде значного ефекту схуднення або очищення лімфи.\n"
    "Норма води це ваша вага помножена на 0,3.\n"
    "Наприклад:\n"
    "Ваша вага 70 кг, то протягом дня ви випиваєте 2100 грамів води.\n"
    "Але!!! Якщо ви мало пʼєте воду, то вводьте цей режим поступово, додаючи по 150 грамів води до вашої норми щодня. Інакше нирки можуть збунтуватись!\n\n"
    "Також вам потрібно зробити стартові заміри та зважитись.\n"
    "Зробіть це завтра зранку, я відправлю вам нагадування.\n"
    "Зважуватися потрібно зранку, перед сніданком, але після першого походу в туалет.\n\n"
    "Заміряйте також обʼєм грудей, талії та стегон.\n"
    "Додатково ви можете заміряти руки та ноги (обʼєм).\n\n"
    "Памʼятайте, що мільйонам людей вдалося покращити стан свого здоровʼя та скинути зайві кілограми.\n"
    "І можливо зараз ви робите найважливіший крок у своєму житті, крок до здорового життя та активного довголіття!\n\n"
    "А я буду вас супроводжувати та допомагати.\n\n"
    "Пізніше ви отримаєте розгорнуте меню на завтра та додаткові інструкції.\n\n"
    "Ваша Наталя Плугіна, нутриціолог, вчитель з йоги та жінка, яка вже двічі відновлювалася від страшних хвороб стресу війни.\n"
    "Я буду рада вам допомогти всіма своїми знаннями."
)